const buttons = document.querySelectorAll(".calc__button");
const result = document.querySelector(".calc__result");
const clear = document.querySelector(".calc__clear");

let arr = ["0"];

const subtractFn = (a, b) => {
  return a - b;
}

const sumFn = (a, b) => {
  return a + b;
}

const multiplyFn = (a, b) => {
  return a * b;
}

const divideFn = (a, b) => {
  return a / b;
}

const calculator = (e) => {
  currentValue = e.currentTarget.innerHTML;
  let currentValueMath = "";
  let arrFlag = false;
  let arrMathFlag = false;
  
  //==========================================================================================================
  // Записываю в массив значение нажатой клавиши
  // Удаляю ноль в начале, если это не десятичная дробь.
  // Т.е. чтоб не было в левой части выражения такого - 0234, а было просто 234.
  //==========================================================================================================

  if (currentValue >= 0 && currentValue <= 9) {
    arr.push(currentValue);
    if (arr[0] === "0" && arr[1] !== "." && arr[1] !== "÷" && arr[1] !== "x" && arr[1] !== "-" && arr[1] !== "+") {
      arr.shift();
    }
  }

//==========================================================================================================
// Проверяю, если в массиве значение равно *,-,+,/. 
// То меняю флаг на тру, чтобы нельзя было в дальнейшем поставить эти значения(т.е. так 12*4-12)
// Также полученное значение заношу в переменную, чтоб в дальнейшем понимать что надо сделать с выражением.
//==========================================================================================================

  for (let i = 0; i < arr.length; i++) {
    if (arr[i] == "÷" || arr[i] == "x" || arr[i] == "-" || arr[i] == "+") {
      arrMathFlag = true;
      currentValueMath = arr[i];
    }
  }

//==========================================================================================================
// Делаю чтоб точку нельзя было поставить 2 раза в одной части выражения. 
// Так же чтобы ее вообще можно было поставить во 2ой части выражения
//==========================================================================================================

  let extraArr = [];
  
  for (let i = 0; i < arr.length; i++) {
    if (arr[i] === "." || arr[i] === ".0" || arr[i] === "0.") {
      arrFlag = true;
      extraArr.push(arr[i]);
    }
  }
  
  if (arrMathFlag === true) {
    arrFlag = false;
  }

  if (extraArr.length > 1) {
    arrFlag = true;
  }
//==========================================================================================================
// Если после и перед точкой не стоит цифра, тогда поставить 0
//==========================================================================================================

for (let i = 0; i < arr.length; i++) {
  if(arr[i] === ".") {
    
    if (!(arr[i - 1] >= 0 && arr[i - 1] <= 9)) {
      arr[i] = "0" + arr[i];
    } else if (!(arr[i + 1] >= 0 && arr[i + 1] <= 9)) {
      arr[i] += "0";
    }
    
    }
  }

//==========================================================================================================
// Записываю в массив значение, если оно удовлетворяет этим условиям
//==========================================================================================================

  if (currentValue === "." && arrFlag === false) {
    arr.push(currentValue);
  }
  
  if((currentValue == "÷" || currentValue == "x" || currentValue == "-" || currentValue == "+") && arrMathFlag === false) {
    arr.push(currentValue);
  }

//==========================================================================================================
// Полученный массив перевожу в строку.
// Т.е будет, н-р str = "124x332";
// и это строка идет на экран, т.е в класс calc__result
//==========================================================================================================
  
  let str = arr.join("");

  for (let i = 0; i < arr.length; i++) {
    result.innerHTML = str;
  }

//==========================================================================================================
// Разбиваю полученную строку в массив по разделителю +, -, *, /.
// Т.е. какой разделитель хранится в переменной currenValueMath, по тому и разделим.
//==========================================================================================================

  let resultArr = str.split(currentValueMath);

//==========================================================================================================
// При нажатии на равно, появляется результат
//==========================================================================================================

  if (currentValue === "=") {
    if (currentValueMath === "÷") {
      result.innerHTML = divideFn(+(resultArr[0]), +(resultArr[1]));
    } else if (currentValueMath === "x") {
      result.innerHTML = multiplyFn(+(resultArr[0]), +(resultArr[1]));
    } else if (currentValueMath === "+") {
      result.innerHTML = sumFn(+(resultArr[0]), +(resultArr[1]));
    } else if (currentValueMath === "-") {
      result.innerHTML = subtractFn(+(resultArr[0]), +(resultArr[1]));
    }
  }
  
//==========================================================================================================
// На кнопку "C" очищает.
//==========================================================================================================  
  if (currentValue == "C") {
    result.innerHTML = "0";
    arr = ["0"];
  }

  console.log(arr);

}

for (let i = 0; i < buttons.length; i++) {
  
  buttons[i].addEventListener("click", calculator);
  
}
